### Terragrunt Plan for `live/dev/demo-app-copy`
**Plan: 1 to add, 3 to change, 1 to destroy.**
<details><summary>Full Plan Output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_service.backend[0] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "backend" {
        id                      = "projects/dev-iac-demo/locations/us-central1/services/demo-app-copy-backend"
        name                    = "demo-app-copy-backend"
        # (28 unchanged attributes hidden)

      ~ template {
            # (8 unchanged attributes hidden)

          ~ containers {
                # (5 unchanged attributes hidden)

              ~ resources {
                  ~ limits            = {
                      ~ "cpu"    = "1" -> "2"
                      ~ "memory" = "512Mi" -> "1Gi"
                    }
                    # (2 unchanged attributes hidden)
                }

                # (2 unchanged blocks hidden)
            }

          ~ scaling {
              ~ max_instance_count = 1 -> 5
              ~ min_instance_count = 0 -> 1
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.frontend[0] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "frontend" {
        id                      = "projects/dev-iac-demo/locations/us-central1/services/demo-app-copy-frontend"
        name                    = "demo-app-copy-frontend"
        # (28 unchanged attributes hidden)

      ~ template {
            # (8 unchanged attributes hidden)

          ~ containers {
                # (5 unchanged attributes hidden)

              ~ resources {
                  ~ limits            = {
                      ~ "cpu"    = "1" -> "2"
                      ~ "memory" = "512Mi" -> "1Gi"
                    }
                    # (2 unchanged attributes hidden)
                }

                # (2 unchanged blocks hidden)
            }

          ~ scaling {
              ~ max_instance_count = 1 -> 5
              ~ min_instance_count = 0 -> 1
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_redis_instance.cache[0] must be replaced
-/+ resource "google_redis_instance" "cache" {
      + alternative_location_id     = (known after apply)
      + auth_string                 = (sensitive value)
      ~ create_time                 = "2025-11-12T05:28:08.039199700Z" -> (known after apply)
      ~ current_location_id         = "us-central1-a" -> (known after apply)
      ~ effective_reserved_ip_range = "10.161.112.8/29" -> (known after apply)
      ~ host                        = "10.161.112.11" -> (known after apply)
      ~ id                          = "projects/dev-iac-demo/locations/us-central1/instances/demo-app-copy-redis" -> (known after apply)
      ~ maintenance_schedule        = [] -> (known after apply)
      ~ maintenance_version         = "20250806_01_00" -> (known after apply)
      ~ memory_size_gb              = 1 -> 5
        name                        = "demo-app-copy-redis"
      ~ nodes                       = [
          - {
              - id   = "node-0"
              - zone = "us-central1-a"
            },
        ] -> (known after apply)
      ~ persistence_iam_identity    = "serviceAccount:service-351604588495@cloud-redis.iam.gserviceaccount.com" -> (known after apply)
      ~ port                        = 6379 -> (known after apply)
      + read_endpoint               = (known after apply)
      ~ read_endpoint_port          = 0 -> (known after apply)
      ~ read_replicas_mode          = "READ_REPLICAS_DISABLED" -> (known after apply)
      - redis_configs               = {} -> null
      ~ redis_version               = "REDIS_7_0" -> (known after apply)
      ~ region                      = "us-central1" -> (known after apply)
      ~ replica_count               = 0 -> (known after apply)
      + reserved_ip_range           = (known after apply)
      + secondary_ip_range          = (known after apply)
      ~ server_ca_certs             = [] -> (known after apply)
      ~ tier                        = "BASIC" -> "STANDARD_HA" # forces replacement
        # (9 unchanged attributes hidden)

      - persistence_config {
          - persistence_mode = "DISABLED" -> null
        }
    }

  # google_sql_database_instance.postgres[0] will be updated in-place
  ~ resource "google_sql_database_instance" "postgres" {
        id                             = "demo-app-copy-pg"
        name                           = "demo-app-copy-pg"
        # (17 unchanged attributes hidden)

      ~ settings {
          ~ availability_type            = "ZONAL" -> "REGIONAL"
          ~ tier                         = "db-g1-small" -> "db-custom-8-32768"
            # (15 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>
<!-- terragrunt-plan-for: live/dev/demo-app-copy -->